tutorials/bladeMachines/extend-4.0/steadyCompressibleMRFFoam/axialRotorStatorMRF/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet_0
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet_0
    {
        type            mixingPlane;
        value           uniform 14.855;
    }
    passageSidesUpper_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    passageSidesLower_0
    {
        type            cyclic;
        value           uniform 14.855;
    }
    hub_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shroud_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    blade_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    
    inlet_0
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet_0
    {
        type            mixingPlane;
        value           uniform 14.855;
    }
    passageSidesUpper_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    passageSidesLower_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    hub_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shroud_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    blade_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
	
    inlet_0
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet_0
    {
        type            mixingPlane;
        value           uniform 14.855;
    }
    passageSidesUpper_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    passageSidesLower_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    hub_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shroud_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    blade_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    
    inlet_1 // $outlet_0
    {
        type            mixingPlane;
        value           uniform 14.855;
    }
    outlet_1 // $outlet_0
    {
        type            zeroGradient;
    }
    passageSidesUpper_1 // $passageSidesUpper_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    passageSidesLower_1 // $passageSidesUpper_0
    {
        type            cyclicGgi;
        value           uniform 14.855;
    }
    hub_1 // $hub_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shroud_1 // $shroud_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    blade_1 // $blade_0
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 14.855;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
}




// ************************************************************************* //
