tutorials/bladeMachines/extend-4.0/steadyCompressibleMRFFoam/axialRotorStatorMRF/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1e-05; // [m/s^2]

CrossPowerLawCoeffs
{
    nu0			nu0   [0 2 -1 0 0 0 0] 1e-06; // [m/s^2]
    nuInf 		nuInf [0 2 -1 0 0 0 0] 1e-06; // [m/s^2]
    m			m 	  [0 0 1 0 0 0 0] 1; // [s]
    n			n     [0 0 0 0 0 0 0] 1; // [-]
}

BirdCarreauCoeffs
{
    nu0			nu0   [0 2 -1 0 0 0 0] 1e-06; // [m/s^2]
    nuInf		nuInf [0 2 -1 0 0 0 0] 1e-06; // [m/s^2]
    k 			k 	  [0 0 1 0 0 0 0] 0; // [s]
    n			n     [0 0 0 0 0 0 0] 1; // [-]
}

// ************************************************************************* //
