tutorials/bladeMachines/extend-4.0/steadyCompressibleMRFFoam/axialRotorStatorMRF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
)

application			steadyCompressibleMRFFoam;

startFrom			startTime;

startTime			0;

stopAt				endTime;

endTime				500;

deltaT          	1;

writeControl    	timeStep;

writeInterval   	25;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	12;

writeCompression 	compressed;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	yes;
//libs    ("libjumpFiniteVolume.so");

// Compute the flux value on each side of a GGI interface
functions
(
    ggiCheck
    {
        // Type of functionObject
        type ggiCheck;

        phi		phi;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libcheckFunctionObjects.so");
    }
    // Compute the flux value on each side of a mixingPlane interface
    mixingPlaneCheck
    {
        // Type of functionObject
        type mixingPlaneCheck;

        phi		phi;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libcheckFunctionObjects.so");
    }
);


// ************************************************************************* //
